---
kind: property
id: P:Autodesk.Revit.DB.Structure.AreaReinforcement.Direction
source: html/7ff9e4ed-e3e9-4bf6-b306-be10c3854d93.htm
---
# Autodesk.Revit.DB.Structure.AreaReinforcement.Direction Property

Retrieve the Major Direction of the Area Reinforcement.

## Syntax (C#)
```csharp
public XYZ Direction { get; }
```